tutorials/multiphase/cavitatingFoam/les/throttle3D/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 300e5;

boundaryField
{
    inlet
    {
        type            totalPressure;
        U               U;
        phi             phiv;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 300e5;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100e5;
    }

    walls
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
